app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "address", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Karol"], ["address", "Ludwika Narbutta, Warszawa, Polska"], ["title", "Costam"], ["created_at", "2017-12-08 19:59:31.795227"], ["updated_at", "2017-12-08 19:59:31.795227"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["address", "Warsaw, Poland, Europe"], ["latitude", 52.2296756], ["longitude", 21.0122287], ["updated_at", "2017-12-08 20:01:04.357459"], ["id", 2]]